app/controllers/carts_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-02-02 01:06:03.464088"], ["updated_at", "2021-02-02 01:06:03.464088"]]
---
  def create
    @cart = Cart.new(cart_params)

    if @cart.save