app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."id" ASC
---
    def index
        @products = Product.all.order(:id)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        product = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]
---
    def destroy
        product = Product.find(params[:id])
        if product.destroy